from pprint import pprint

import pandas as pd
import json
import io

test_graph_nodes = [
    # ЮЛ
    {
        'data': {'id': 'LE1', 'label': 'БСЗ'},
    },

    # Локация
    {
        'data': {'id': 'L1', 'label': 'Брусника.Проектирование'},
    },
    {
        'data': {'id': 'L2', 'label': 'Дирекция'},
    },
    {
        'data': {'id': 'L3', 'label': 'Брусника.Тюмень'},
    },

    # Подразделение
    {
        'data': {'id': 'SU1', 'label': 'Подразделение ""Арес""'},
    },
    {
        'data': {'id': 'SU2', 'label': 'Подразделение ""Артемида""'},
    },
    {
        'data': {'id': 'SU3', 'label': 'Подразделение ""Афина""'},
    },
    {
        'data': {'id': 'SU4', 'label': 'Подразделение ""Афина""'},
    },
    {
        'data': {'id': 'SU5', 'label': 'Подразделение ""Афина""'},
    },

    # Отдел
    {
        'data': {'id': 'D1', 'label': 'Отдел ""Бельгия""'},
    },
    {
        'data': {'id': 'D2', 'label': 'Отдел ""Великобритания""'},
    },

    # Группа
    {
        'data': {'id': 'G1', 'label': 'Группа ""Москва""'},
    },
    {
        'data': {'id': 'G2', 'label': 'Группа ""Стамбул""'},
    },
    {
        'data': {'id': 'G3', 'label': 'Группа ""Лондон""'},
    },
    {
        'data': {'id': 'G4', 'label': 'Группа ""Санкт-Петербург""'},
    },
    {
        'data': {'id': 'G5', 'label': 'Группа ""Санкт-Петербург""'},
    },

    # Человек
    {
        'data': {'id': 'БСЗ131', 'label': 'Вакансия',
                 'job_title': 'Главный специалист-архитектор', 'job_type': 'Бизнес'},
    },
    {
        'data': {'id': 'БСЗ132', 'label': 'Вакансия',
                 'job_title': 'Специалист', 'job_type': 'Сервис'},
    },
    {
        'data': {'id': 'БСЗ133', 'label': 'Сотрудник Брусники 1',
                 'job_title': 'Специалист', 'job_type': 'Бизнес'},
    },
    {
        'data': {'id': 'БСЗ134', 'label': 'Сотрудник Брусники 2',
                 'job_title': 'Главный специалист-инженер', 'job_type': 'Бизнес'},
    },
    {
        'data': {'id': 'БСЗ135', 'label': 'Вакансия',
                 'job_title': 'Ведущий инженер', 'job_type': 'Бизнес'},
    },
]

# Add edges
test_graph_edges = [
    {'data': {'source': 'LE1', 'target': 'L1'}},
    {'data': {'source': 'LE1', 'target': 'L2'}},
    {'data': {'source': 'LE1', 'target': 'L3'}},

    {'data': {'source': 'L1', 'target': 'SU1'}},
    {'data': {'source': 'L1', 'target': 'SU2'}},
    {'data': {'source': 'L1', 'target': 'SU3'}},

    {'data': {'source': 'L2', 'target': 'SU4'}},

    {'data': {'source': 'L3', 'target': 'SU5'}},

    {'data': {'source': 'SU1', 'target': 'D1'}},
    {'data': {'source': 'SU1', 'target': 'D2'}},

    {'data': {'source': 'D1', 'target': 'G1'}},

    {'data': {'source': 'D2', 'target': 'G2'}},

    {'data': {'source': 'SU2', 'target': 'G3'}},

    {'data': {'source': 'SU3', 'target': 'G4'}},
    {'data': {'source': 'SU4', 'target': 'G5'}},

    {'data': {'source': 'G1', 'target': 'БСЗ131'}},

    {'data': {'source': 'G2', 'target': 'БСЗ132'}},

    {'data': {'source': 'D2', 'target': 'БСЗ133'}},

    {'data': {'source': 'G3', 'target': 'БСЗ134'}},
    {'data': {'source': 'G3', 'target': 'БСЗ135'}},
]

test_graph_data = test_graph_nodes + test_graph_edges


def generate_graph_data_from_csv(csv_content: str):
    print("got")
    # Read the CSV string into a DataFrame
    csv_file = io.StringIO(csv_content)
    df = pd.read_csv(csv_file).fillna('')

    el_nodes = df[df["ЮЛ"] != ""]["ЮЛ"].unique()

    el_to_locs = {}
    for el_node in el_nodes:
        loc = {el_node: df[df["ЮЛ"] == el_node]["Локация"].unique().tolist()}
        el_to_locs[el_node] = loc

    loc_to_subunit = []
    for el_node in el_nodes:
        for el_to_loc in el_to_locs[el_node]:
            subunit = df[(df["ЮЛ"] == el_node) & (df["Локация"] == el_to_loc)]["Подразделение"].unique().tolist()

    print(el_nodes)
    print(el_to_locs)
    print(loc_to_subunit)

    return test_graph_data


data = 'Номер позиции,ЮЛ,Локация,Подразделение,Отдел,Группа,Должность,ФИО,Тип работы БСЗ131,БСЗ,Брусника.Проектирование,"Подразделение ""Арес""","Отдел ""Бельгия""","Группа ""Москва""",Главный специалист-архитектор,Вакансия,Бизнес БСЗ132,БСЗ,Брусника.Проектирование,"Подразделение ""Арес""","Отдел ""Великобритания""","Группа ""Стамбул""",Специалист,Вакансия,Сервис БСЗ133,БСЗ,Брусника.Проектирование,"Подразделение ""Арес""","Отдел ""Великобритания""",,Специалист,Сотрудник Брусники 1,Бизнес БСЗ134,БСЗ,Брусника.Проектирование,"Подразделение ""Артемида""",,"Группа ""Лондон""",Главный специалист-инженер,Сотрудник Брусники 2,Бизнес БСЗ135,БСЗ,Брусника.Проектирование,"Подразделение ""Артемида""",,"Группа ""Лондон""",Ведущий инженер,Вакансия,Бизнес БСЗ136,БСЗ,Брусника.Проектирование,"Подразделение ""Артемида""",,"Группа ""Лондон""",Ведущий конструктор,Вакансия,Бизнес БСЗ137,БСЗ,Брусника.Проектирование,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Специалист,Сотрудник Брусники 3,Бизнес БСЗ138,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Главный ассистент,Сотрудник Брусники 4,Бизнес БСЗ139,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Главный бизнес-ассистент,Сотрудник Брусники 5,Бизнес БСЗ140,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Специалист,Сотрудник Брусники 6,Сервис БСЗ141,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Специалист,Сотрудник Брусники 7,Бизнес БСЗ142,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Специалист,Вакансия,Бизнес БСЗ143,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Специалист,Сотрудник Брусники 8,Бизнес БСЗ144,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Специалист,Сотрудник Брусники 9,Бизнес БСЗ145,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Специалист,Сотрудник Брусники 10,Сервис БСЗ146,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Специалист,Сотрудник Брусники 11,Бизнес БСЗ147,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Специалист,Сотрудник Брусники 12,Бизнес БСЗ148,БСЗ,Дирекция,"Подразделение ""Афина""",,"Группа ""Санкт-Петербург""",Специалист,Сотрудник Брусники 13,Бизнес БСЗ149,БСЗ,Дирекция,"Подразделение ""Афина""",,,Главный бухгалтер,Сотрудник Брусники 14,Бизнес БСЗ150,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Сотрудник Брусники 15,Бизнес БСЗ151,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Сотрудник Брусники 16,Бизнес БСЗ152,БСЗ,Дирекция,"Подразделение ""Афина""",,,Специалист,Сотрудник Брусники 17,Бизнес БСЗ154,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Сотрудник Брусники 19,Бизнес БСЗ155,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Сотрудник Брусники 20,Бизнес БСЗ156,БСЗ,Дирекция,"Подразделение ""Афина""",,,Специалист,Сотрудник Брусники 21,Бизнес БСЗ157,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Вакансия,Бизнес БСЗ158,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Вакансия,Сервис БСЗ159,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Сотрудник Брусники 22,Бизнес БСЗ160,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Вакансия,Бизнес БСЗ161,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Сотрудник Брусники 23,Бизнес БСЗ162,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Сотрудник Брусники 24,Бизнес БСЗ163,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Сотрудник Брусники 25,Бизнес БСЗ164,БСЗ,Дирекция,"Подразделение ""Афина""",,,Директор,Сотрудник Брусники 26,Бизнес БСЗ165,БСЗ,Дирекция,"Подразделение ""Афина""",,,Специалист,Сотрудник Брусники 27,Бизнес БСЗ166,БСЗ,Брусника.Тюмень,"Подразделение ""Афина""",,,Специалист,Вакансия,Бизнес'

if __name__ == "__main__":
    print(generate_graph_data_from_csv(data))
